import re
import requests

""" 代理IP的网址已失效
iplist = []##初始化一个list用来存放获取到的IP
html = requests.get("http://haoip.cc/tiqu.htm")
iplistn = re.findall(r'r/>(.*?)<b', html.text, re.S)##表示从html.text中获取所有r/><b中的内容，re.S的意思是包括匹配包括换行符，findall返回的是个list
for ip in iplistn:
    i = re.sub('\n', '' , ip)##re.sub 是re模块替换的方法，这儿表示将\n替换为空
    iplist.append(i.strip())##添加到上面初始化的list里面, i.strip()的意思是去掉字符串的空格
    print(i.strip())
print(iplist)
"""
"""
        self.iplist = [
            '120.52.72.21:80',
            '124.206.133.227:80',
            '115.28.101.22:3128',
            '124.88.67.54:83',
            '122.72.33.138:80',
            '183.61.236.54:3128',
            '111.23.4.138:8000',
            '221.213.44.5:3128',
            '101.200.169.110:80',
            '223.99.228.54:80',
            '120.85.132.234:80',
            '113.7.101.139:8998',
            '119.29.103.13:8888',
            '60.206.113.252:3128',
            '115.28.20.126:3128',
            '61.163.59.65:3128',
            '221.212.221.194:3128',
            '123.146.128.15:3128',
            '61.185.137.126:3128',
            '122.114.36.13:808',
            '221.226.82.130:8998',
            '115.29.76.108:8088',
            '124.47.7.38:80',
            '112.112.70.118:80',
            '183.196.242.197:3128',
            '219.129.164.122:3128',
            '124.207.186.154:3128',
            '202.108.2.42:80',
            '202.118.8.13:3128'
        ]
        """
